NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM21/BGM210PA32JIA.svd
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RUNNING</name>
              <description>Running</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LBTSYNC</name>
              <description>LBT Synchronizing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LBTRUNNING</name>
              <description>LBT Running</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LBTPAUSED</name>
              <description>LBT has been paused.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUT0RUNNING</name>
              <description>Timeout Counter 0 Running</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUT0SYNC</name>
              <description>Timeout Counter 0 Synchronizing</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUT1RUNNING</name>
              <description>Timeout Counter 1 Running</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOUT1SYNC</name>
              <description>Timeout Counter 1 Synchronizing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICV0</name>
              <description>CC0 Capture Valid</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PROTIMER_CC0_PRE, -BASE or -WRAP does not contain a valid capture value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>PROTIMER_CC0_PRE, -BASE or -WRAP contains a valid and unread capture value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV1</name>
              <description>CC1 Capture Valid</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PROTIMER_CC1_PRE, -BASE or -WRAP does not contain a valid capture value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>PROTIMER_CC1_PRE, -BASE or -WRAP contains a valid and unread capture value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV2</name>
              <description>CC2 Capture Valid</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PROTIMER_CC2_PRE, -BASE or -WRAP does not contain a valid capture value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>PROTIMER_CC2_PRE, -BASE or -WRAP contains a valid and unread capture value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV3</name>
              <description>CC3 Capture Valid</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PROTIMER_CC3_PRE, -BASE or -WRAP does not contain a valid capture value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>PROTIMER_CC3_PRE, -BASE or -WRAP contains a valid and unread capture value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV4</name>
              <description>CC4 Capture Valid</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>PROTIMER_CC4_PRE, -BASE or -WRAP does not contain a valid capture value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>PROTIMER_CC4_PRE, -BASE or -WRAP contains a valid and unread capture value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV5</name>
              <description>CC5 Capture Valid</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICV6</name>
              <description>CC6 Capture Valid</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICV7</name>
              <description>CC7 Capture Valid</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECNT</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PRECNT</name>
              <description>Pre Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECNT</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>BASECNT</name>
              <description>Base Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRAPCNT</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRAPCNT</name>
              <description>Wrap Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEPRE</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRECNTV</name>
              <description>Pre counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BASECNTV</name>
              <description>Base counter value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LWRAPCNT</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LWRAPCNT</name>
              <description>Latched Wrap Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECNTTOPADJ</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PRECNTTOPADJ</name>
              <description>PRECNT Top Adjust Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECNTTOP</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00FFFF00</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>PRECNTTOPFRAC</name>
              <description>PRECNT Top Fractional Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRECNTTOP</name>
              <description>PRECNT Top Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASECNTTOP</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>BASECNTTOP</name>
              <description>BASECNT Top Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRAPCNTTOP</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRAPCNTTOP</name>
              <description>WRAPCNT Top Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT0CNT</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT0PCNT</name>
              <description>TOUT0PCNT Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0CNT</name>
              <description>TOUT0CNT Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT0CNTTOP</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00FF00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT0PCNTTOP</name>
              <description>TOUT0PCNTTOP Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0CNTTOP</name>
              <description>TOUT0CNTTOP Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT0COMP</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT0PCNTCOMP</name>
              <description>TOUT0PCNTCOMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT0CNTCOMP</name>
              <description>TOUT0CNTCOMP Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT1CNT</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT1PCNT</name>
              <description>TOUT1PCNT Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1CNT</name>
              <description>TOUT1CNT Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT1CNTTOP</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00FF00FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT1PCNTTOP</name>
              <description>TOUT1PCNTTOP Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1CNTTOP</name>
              <description>TOUT1CNTTOP Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUT1COMP</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUT1PCNTCOMP</name>
              <description>TOUT1PCNTCOMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUT1CNTCOMP</name>
              <description>TOUT1CNTCOMP Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LBTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F1F1FFF</resetMask>
          <fields>
            <field>
              <name>STARTEXP</name>
              <description>Start Exponent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXP0</name>
                  <description>STARTEXP value = 0 (used for Fast TX)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP1</name>
                  <description>STARTEXP value = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP2</name>
                  <description>STARTEXP value = 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP3</name>
                  <description>STARTEXP value = 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP4</name>
                  <description>STARTEXP value = 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP5</name>
                  <description>STARTEXP value = 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP6</name>
                  <description>STARTEXP value = 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP7</name>
                  <description>STARTEXP value = 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP8</name>
                  <description>STARTEXP value = 8</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXEXP</name>
              <description>Maximum Exponent</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXP0</name>
                  <description>MAXEXP value = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP1</name>
                  <description>MAXEXP value = 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP2</name>
                  <description>MAXEXP value = 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP3</name>
                  <description>MAXEXP value = 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP4</name>
                  <description>MAXEXP value = 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP5</name>
                  <description>MAXEXP value = 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP6</name>
                  <description>MAXEXP value = 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP7</name>
                  <description>MAXEXP value = 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXP8</name>
                  <description>MAXEXP value = 8</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCADELAY</name>
              <description>Clear Channel Assessment Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCAREPEAT</name>
              <description>Clear Channel Assessment Repeat</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXEDBACKOFF</name>
              <description>Fixed backoff</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRYLIMIT</name>
              <description>Retry Limit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
